<template>
  <div class="rounded-box q-mb-lg">
    <div class="page-search">
      <q-btn @click="$router.back()" label="Назад"  icon="arrow_back" class="q-py-md" color="primary" outline unelevated no-caps/>
      <p class="no-margin title text-bold col-grow">История</p>

    </div>
  </div>
  <div class="rounded-box">
    - добавить складскую систему (категория - подкатегория - изделие, у изделия свойства: расходник\нет, описание, вес в граммах<br>
    - изменить структуру URLов для разных систем<br>
    - добавить в случае если сотрудника роль участвует в этапе (на ПК версии) рядом с кнопкой описание (окно) для действий по заявке<br>
    - добавить страницу с историей обновлений (статикой, вывод моего текста на странцие и все)<br><br>


    > В работе: оффлайн приложение, чтобы если нет интернета - сотрудник мог заполнить чек лист и прикрепить нужную информацию<br>
    > В работе: новый интерфейс страницы с прикреплением сотрудника к заявке<br>
    > В работе: страница для одного клиента + ее редактирование<br><br>

    > Известная ошибка: поиск работает некорректно для букв маленького и большого регистра. Исправим после перехода на боевую версию приложения и новую базу<br>
    > Известная ошибка: если роль имеет доступ к просмотру этапа, то все равно может его заполнить (исправим к вечеру 07.09)<br><br>

    ПН 04.09<br><br>

    > Добавлены типы заявок<br>
    > Добавлены категории и модели доп оборудования<br>
    > Добавлена новая модель оборудования<br>
    > Исправлена ошибка: в приложении у сотрудника не нажималась кнопка для перехода на следующий этап<br>
    > Исправлена ошибка: добавление заявки не осуществлялось без выбора оборудования<br>
    > Исправлена ошибка: некорректная дата при сканировании QR кода оборудования<br>
    > Исправлена ошибка: убрано зависания чата при отправке сообщения<br>
    > Внесена правка по изменению времени для уже назначенного сотрудника<br>
    > Внесена правка по изменению\добавлению оборудования к заявке<br>
    > Внесена правка по выводу крайнего срока заявки в таблицу<br>
    > Добавлена фильтрация оборудования, изменена выводимая информация в таблице<br>
    > Добавлена для конкретного оборудования дата подписания сервисной книжки<br>
    > Добавлено прикрепление telegram никнейма к сотруднику для дальнейших оповещений<br><br>

    ЧТ 07.09<br><br>

    > Добавлена возможность просмотра этапов заявок для ролей (для главного технолога в приоритете)<br>
    > Добавлен адрес объекта в таблице заявок с возможностью поиска по нему<br>
    > Убрана модель оборудования из колонок в таблице заявок<br>
    > Внесена правка по смене оборудования внутри заявки (вывод оборудования по модели и С\Н)<br>
    > Внесена правка по поиску в таблице заявок: фесли стоит фильтр показывать завершенные, то ищет среди завершенных, если нет - то среди активных<br>
    > Исправлена ошибка: после завершения заявки этап не удаляется<br>
    > Исправлена ошибка: QR код не загружался для оборудования клиента<br>
    > Исправлена ошибка: если объект неизвестен, то не дает сменить объект при редактировании заявки<br><br>

    ВС 10.09<br><br>

    > Внесена правка по интерфейсу для Главного технолога: теперь он работает в полноэкранной версии системы, видит свои кнопки и полную историю по заявкам и остальному<br>
    > Добавлена кнопка "Печать" для чеклистов с выводом информации о С\Н оборудовании и модели + сразу кидает на печать страницы<br>
    > Изменен вывод данных на таблице с заявками - скрывать время создания заявки и С\Н оборудования в таблице, выводить комментарий к заявке<br><br>


    СР 13.09<br><br>

    > Добавлена на сайт информация о текущих правках и история обновлений для системы<br>
    > Добавлены этапы по текущим заявкам и чек-листы<br>
    > Добавлены данные для вывода на странице печати для чек-листов (информация о доп оборудовании, объекте, кол-ве систем на объектах,<br>
    > Добавлен вывод информации для инженера об общем кол-ве систем на объекте для заявке<br>


  </div>
</template>
<script setup lang="ts">
</script>
